tap "dotzero/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jhawthorn/fzy"
tap "romkatv/powerlevel10k"
tap "thecasualcoder/stable"
tap "vmware-tanzu/carvel"
tap "warrensbox/tap"
tap "homebrew/autoupdate"
brew "git"
brew "jq"
brew "grpc"
brew "automake"
brew "coreutils"
brew "asdf"
brew "bat"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "direnv"
brew "entr"
brew "findutils"
brew "fzf"
brew "gnu-sed"
brew "gnutls"
brew "pinentry-mac"
brew "gnupg"
brew "gotop"
brew "hdf5"
brew "helm"
brew "highlight"
brew "jpeg"
brew "mackup"
brew "mas"
brew "moreutils"
brew "neovim"
brew "nvm"
brew "tldr"
brew "git-extras"
brew "openjdk"
brew "openssl@3", link: true
brew "pidof"
brew "pinentry-mac"
brew "pre-commit"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "vim"
brew "k9s"
brew "wget"
brew "zplug"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "dotzero/tap/git-profile"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "thecasualcoder/stable/tf-summarize"
brew "lsd"
brew "vivid"
brew "awscli"
brew "aws-vault"
cask "1password"
cask "1password-cli"
cask "busycal"
cask "raycast"
# Docker CE
cask "docker"
# Team comm software
cask "slack"
cask "steam"
cask "google-drive"
# Screenshot measurement and annotation tool
cask "shottr"
# cask "intune-company-portal"
# Office suite
cask "microsoft-auto-update"
cask "microsoft-office"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
cask "docker"
cask "telegram-desktop"
# Video communication and virtual meeting platform
cask "zoom"
# Enable Windows-like alt-tab
cask "alt-tab"
# Voice and text chat software
cask "discord"
# Collection of apps available by subscription
cask "setapp"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Terminal emulator as alternative to Apple's Terminal app
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
# Web browser focusing on security
cask "tor-browser"
# Music streaming service
cask "spotify"
# All-in-one bookmark manager
cask "raindropio"
# WebKit based web browser
cask "orion"
cask "openinterminal"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
cask "microsoft-teams"
# Grammarly for desktop
cask "grammarly-desktop"
cask "intune-company-portal"
# Mac App Store Installs
mas "CopyClip", id: 595191960
# mas "Dropzone 4", id: 1485052491
mas "Flashtex", id: 1534437697
mas "Flow", id: 1423210932
# mas "Keeper Password Manager", id: 414781829
mas "Kindle", id: 405399194
# mas "Save to Raindrop.io", id: 1549370672
mas "Todoist", id: 585829637
